[
 "It's a great drone d j I does a wonderful job with their flight computers and gps and motors, and it's flight time versus agility and maneuverability, and the range of expertise that can have a lot of fun and get really good video shots with this drone.It's great for beginners. if you have no experience, try doing a flight simulation on a computer, with a similar controller, or a cheap drone to get the conset and controls down.",
 "I purchased a DJI FPV bundle for $799.00 from this seller. The DJI FPV bundle arrived defective — it powered on and the motors would activate, but as soon as I tried to take off, it displayed an error code and would not fly. I returned the defective DJI FPV bundle exactly as received. The seller refunded only $0.01 and kept $798.99 as a “restocking fee.” Charging a massive restocking fee for a defective DJI FPV bundle is not only unethical but may violate consumer protection laws, including the FTC Act (15 U.S.C. §§ 41–58) and Amazon’s own policy prohibiting excessive return fees for defective products.",
 "Great condition. Came quickly and delivered when I was told it would be. Like new item that is practically brand new. Excellent drone for a variety of uses. I'm enjoying it immensely",
 "I bought this drone for almost $1,000 and it looks like it was used. The glasses don't turn on, they didn't have the protective plastic on the lenses. The box was in very bad condition.",
 "The drone is good but not as easy to get up and running. But straight out of a alien movie! Nice! Lost star since it didnt include the extra battery and an extra pair of knobs for the controller.",
 "Drone came preused, the drone bombs off has some scratches. Had a lot of problems with g. P. S the drone didn't want to fly. It's something I don't know what to say. It was my son birthday and there it goes.",
 "After a short time I had problems with the battery, it stopped receiving a charge.",
 "We bought this drone with the intention of sharing it between dad and son, but so far, it's been my son taking the skies. I've been busy with training modules on the laptop, with mixed success. The drone's speed and agility are truly impressive. We've chased birds, cars, and even wild animals from high above, capturing some amazing footage. Watching the video replay is just as thrilling as flying the drone itself. My son loves the FPV experience, and he can switch between safety mode for beginners and full-speed mode for some seriously wild flying. We’ve sent it so high and far that we lost sight of it, but the return-to-home feature is fantastic—just push a button, and the drone flies back and lands gently. The drone is lightweight, though heavier than expected, and the battery life is robust but short, typically lasting 10-15 minutes. Given the short flight times, extra batteries are a must. You'll also need a special case and potentially a second drone for spare parts, which is par for the course with any hobby. Overall, it's an amazing drone with a few extra costs and considerations. Our next mission is to take it to the middle of nowhere and chase buffalo. Stay tuned for more!",
 "I loved the fact that it was fast I also like the fact that it is compatible with the motion controller. Although I do not like the fact that both times I have purchased the same drone and both times it acted sporadically and during flight actually it was while it was hovering all of a sudden it took off to the left and then back to the right and did that two or three more times in a matter of a couple seconds and then it shot straight up in the air the goggles quit recording at 226 ft but the Drone kept going in the lower right hand corner of the goggles it said battery overload battery overload battery overload flashing and then it went completely dead and came straight down to the ground and landed on my neighbor's roof and destroyed the Drone so after I sent that drone back which UPS seem to lose in the mail and still have not refunded me I bought the Avatar 2 and that drone flew amazingly it was very simple to hook to the motion controller where the DJI fpv was not as easy it was almost like the Avada 2 was built for the motion controller where the DJI fpv made it an absolute hassle and a pain in the butt to hook the motion controller to the DJ ifp anyway both times I ordered the DJI fpv it acted total sporadically like a misbehaved puppy",
 "If you’ve never flown the DJI FPV, watch a tutorial video. Or power on the remote first then the goggles and then the drone last. That’s just how I do it out of habit. Follow the prompts through the goggles, make sure you have the remote the goggle and the drone somewhat close together so you’re sure everything syncs correctly, then once you hear the final beeps, make sure you’re in the comfortable mode, I’d start with (Normal Mode) should be the button on your controller front left if you’re holding it, because it’s the ONLY mode that has the automatic collision avoidance from buildings the ground etc, the other 2 modes (SPORT & MANUAL) DO NOT have that. Stay away from trees, bodies of water & everything else especially if you’re a beginner until you’re comfortable. Then at the same time, take your left and right thumb sticks on your controller down and in towards each other like an L & and backwards L with your right thumb. The motors will start at idle, make sure your props are on correctly!!! I almost lost my drone bc of that reason (my own fault in a hurry) I know the activation part can be very irritating to some. It did frustrate me a little bit but once I got it, boy, oh boy was it worth it! This damn thing is wicked! It’s pretty fast! Try sport mode, or manual mode but just be ready because it will climb altitude so fast and it will go in whatever direction you want to at about 90 miles an hour, it seems like. It is very easy to fly the FPV goggles are my favorite part about it! You may want to sit down or lean up against something while you’re flying because it will throw your equilibrium off a little bit. The quality is top-notch! The performance is top-notch! The range is top-notch! The quality of the connectivity in general is great! It’s got awesome features, like. Return to home automatically, it’ll record a video if it loses signal somehow or you ignore the warnings of low battery and it dies out you can see the last thing it saw right before you lost transmission. Not one bad thing to say about this bad boy. I could fly this thing for hours on end! It’s worth every penny in my opinion. Purchase yourself a couple extra flight batteries when you can it’s worth it! I did. I also bought an extra battery for my goggles as well. I haven’t had to change it out yet (during a 3 flight battery run) - my goggles will be right around 40% still. Same with the remote, it holds power the best out of them all, it’ll usually be around or above 75% after all of this",
 "I'm sorry that I actually bought this ~$800 paperweight. With the FCC drone 'regulations,' I've only been able to fly this thing ONCE. Of the one time I did, it was so incredibly loud even several hundred feet in the air (but of course, can't go above 400 ft, God forbid, regulations and all). I constantly get the 'remote ID not found' error despite paying for the stupid test to get a certificate license to be able to fly IN MY BACKYARD. Not in any restricted zones - my !@#$%$$ backyard. And even though I did everything as instructed, I cannot get it off the ground because of this. This is not the case with every vendor - I'm only aware of DJI kowtowing to this stupidity. Never again, DJI. Wish I never wasted my money on this.",
 "Интересная штука. Быстро дохнет заряд да и сам сдох быстро. Неуклюжая вешь, запуталась у ребёнка в волосах, напугала малышку.",
 "Приехал, и то с трудностями. Отваливается связь с джойстиком, постоянно требуется перезапуск, не летает из-за этого совсем! Крайне не доволен покупкой! Не советую к приобретению!",
 "Долгая доставка. Вводят в заблуждение. На картинке одно по факту другое. На картинке с камерой пришло без камеры. Обман.",
 "Дешёвый, поскольку в нём особо ничего нет, то перепутать что-то сложно. Инструкция на китайском, пришлось как-то нейронками пыхтеть и интернет перемалывать чтобы хоть что-то узнать... Заряжается видимо только от ПК, может быть где-то узнаю какой блок питания к нему нужен... Непонятно можно ли купить какой-то шнур и подключить пульт к симулятору на ПК, ведь без него толку от дрона мало, летает аля 4 минуты, трясётся, летит куда хочет, возможно при доставке погнулись то ли защитные кольца, то ли лопасти то ли ещё что-то, или я так криво доставал, кренит сильно вперёд и вправо. Стики силой пытаются вернуться в исходное положение, так что ни о каком точном полёте речи нет, банально пальцы быстро устают, ещё и пульт махонький"
]